Catalogs/КлассыОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КлассыОбъектовЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяПодклассы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РемонтныйЦиклПоИнтервалуНаработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКлассУзла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДляКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязателенДляЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиНаработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассчитыватьОстаточныйРесурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрироватьОтИсточника</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьРегистрации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПересчитыватьСреднесуточноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйПериодРасчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальныйПериодРасчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РемонтныйЦикл</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРемонтов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаВремени</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалНаработки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеРемонты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРемонтов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоИнтервалуНаработки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаВремени</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалНаработки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассыОбъектовЭксплуатации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура проверки заполнения табличных частей правил планирования
//
// Параметры:
// 		Объект - СправочникОбъект.КлассыОбъектовЭксплуатации, СправочникОбъект.ПодклассыОбъектовЭксплуатации - Объект справочника, табличные части которого необходимо проверить
// 		МассивНеПроверяемыхРеквизитов - Массив - Массив имен реквизитов, которые необходимо удалить из проверяемых
// 		Отказ - Булево - Признак ошибки.
//
Процедура ПроверкаЗаполненияПравилПланирования(Объект, МассивНеПроверяемыхРеквизитов, Отказ = Ложь) Экспорт
	
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалВремениПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ЕдиницаВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалНаработки");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ИнтервалНаработкиПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("РемонтныйЦикл.ПоказательНаработки");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалВремениПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ЕдиницаВремени");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалНаработки");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ИнтервалНаработкиПланирования");
	МассивНеПроверяемыхРеквизитов.Добавить("ПрочиеРемонты.ПоказательНаработки");
	
	СоответствиеВидовРемонтов = Новый Соответствие;
	
	Для Каждого Строка Из Объект.РемонтныйЦикл Цикл
		
		АдресОшибки = НСтр("ru='в строке %НомерСтроки% списка ""Ремонтный цикл""';uk='в рядку %НомерСтроки% списку ""Ремонтний цикл""'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Строка.НомерСтроки);
		
		НомерСтроки = Строка.НомерСтроки;
		
		Если СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта) <> Неопределено Тогда
			// Вид ремонта уже присутствует в табличной части в другой строке
			
			ТекстОшибки = НСтр("ru='Вид ремонта ""%ВидРемонта%"" %АдресОшибки% уже присутствует в строке %НомерПредыдущейСтроки%';uk='Вид ремонту ""%ВидРемонта%"" %АдресОшибки% вже присутній в рядку %НомерПредыдущейСтроки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%АдресОшибки%", АдресОшибки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВидРемонта%", Строка.ВидРемонта);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерПредыдущейСтроки%", Формат(СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта), "ЧГ=0"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				Объект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ВидРемонта"),,
				Отказ);
		Иначе
			СоответствиеВидовРемонтов.Вставить(Строка.ВидРемонта, НомерСтроки);
		КонецЕсли;
		
		Если Объект.РемонтныйЦиклПоИнтервалуНаработки Тогда
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';uk='Не заповнена колонка ""Міжремонтний інтервал"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ИнтервалНаработки"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ПоказательНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Единица измерения"" %АдресОшибки%';uk='Не заповнена колонка ""Одиниця вимірювання"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ПоказательНаработки"),
					,
					Отказ);
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';uk='Не заповнена колонка ""Міжремонтний інтервал"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ИнтервалВремени"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ЕдиницаВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Единица измерения"" %АдресОшибки%';uk='Не заповнена колонка ""Одиниця вимірювання"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ЕдиницаВремени"),
					,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СоответствиеВидовРемонтов.Очистить();
	
	Для Каждого Строка Из Объект.ПрочиеРемонты Цикл
		
		АдресОшибки = НСтр("ru='в строке %НомерСтроки% списка ""Прочие ремонты""';uk='в рядку %НомерСтроки% списку ""Інші ремонти""'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Строка.НомерСтроки);
		
		Если СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта) <> Неопределено Тогда
			// Вид ремонта уже присутствует в табличной части в другой строке
			
			ТекстОшибки = НСтр("ru='Вид ремонта ""%ВидРемонта%"" %АдресОшибки% уже присутствует в строке %НомерПредыдущейСтроки%';uk='Вид ремонту ""%ВидРемонта%"" %АдресОшибки% вже присутній в рядку %НомерПредыдущейСтроки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%АдресОшибки%", АдресОшибки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВидРемонта%", Строка.ВидРемонта);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерПредыдущейСтроки%", Формат(СоответствиеВидовРемонтов.Получить(Строка.ВидРемонта), "ЧГ=0"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				Объект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РемонтныйЦикл", Строка.НомерСтроки, "ВидРемонта"),,
				Отказ);
		Иначе
			СоответствиеВидовРемонтов.Вставить(Строка.ВидРемонта, НомерСтроки);
		КонецЕсли;
		
		Если Строка.ПоИнтервалуНаработки Тогда
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';uk='Не заповнена колонка ""Міжремонтний інтервал"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ИнтервалНаработки"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ПоказательНаработки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Единица измерения"" %АдресОшибки%';uk='Не заповнена колонка ""Одиниця вимірювання"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ПоказательНаработки"),
					,
					Отказ);
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(Строка.ИнтервалВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Межремонтный интервал"" %АдресОшибки%';uk='Не заповнена колонка ""Міжремонтний інтервал"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ИнтервалВремени"),
					,
					Отказ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.ЕдиницаВремени) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрЗаменить(НСтр("ru='Не заполнена колонка ""Единица измерения"" %АдресОшибки%';uk='Не заповнена колонка ""Одиниця вимірювання"" %АдресОшибки%'"), "%АдресОшибки%", АдресОшибки),
					Объект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПрочиеРемонты", Строка.НомерСтроки, "ЕдиницаВремени"),
					,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает наборы свойств по классу объектов эксплуатации
//
// Параметры:
// 		Класс - СправочникСсылка.КлассыОбъектовЭксплуатации - Ссылка на класс.
//
// Возвращаемое значение:
// 		Структура - Структура наборов свойств.
//
Функция ПолучитьНаборыСвойств(Класс) Экспорт
	
	СтруктураНаборов = Новый Структура(
		"ПаспортныеХарактеристики",
		Неопределено);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Классы.НаборСвойств КАК ПаспортныеХарактеристики
		|ИЗ
		|	Справочник.КлассыОбъектовЭксплуатации КАК Классы
		|ГДЕ
		|	Классы.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Класс);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СтруктураНаборов;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНаборов, Выборка);
	КонецЕсли;
	
	Возврат СтруктураНаборов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
